# encoding = utf-8
"""
            缅文日期表达
    1、缅文数字 0-10
        用法: figure.index('缅文数字')  返回阿拉伯数字
    2、缅文“年、月、日”表达
    3.缅文1—12月 (လ可以省略)
        用法: 和1. 一样
    4.缅文星期表达 周一-周日

    举例：
        2021年7月15日星期四
            完整表达：၂၀၂၁ ခုနှစ် ဇူလိုင် လ ၁၅ ရက်နေ့
            简略表达：
                （日—月—年） ၁၅ -- ဇူလိုင် -- ၂၀၂၁
                （年—月—日） ၂၀၂၁ -- ၇ -- ၁၅
"""

figure = ['၀', '၁', '၂', '၃', '၄', '၅', '၆', '၇', '၈', '၉', '၁၀']

year = ['ခုနှစ်', 'ပြည့်နှစ်']
month = ['လ']
day = ['ရက်', 'ရက်နေ့']

months = ['ဇန်နဝါရီလ', 'ဖေဖော်ဝါရီလ', 'မတ်လ', 'ဧပြီလ', 'မေလ', 'ဇွန်လ', 'ဇူလိုင်လ', 'သြဂုတ်လ', 'စက်တင်ဘာလ',
          'အောက်တိုဘာလ', 'နိုဝင်ဘာလ', 'ဒီဇင်ဘာလ']

week=['တနင်္လာနေ့','အင်္ဂါနေ့','ဗုဒ္ဓဟူးနေ့','ကြာသပတေးနေ့','သောကြာနေ့','စနေနေ့','တနင်္ဂနွေနေ့']